org/2021-33.org
#+SETUPFILE: ./hugo_setup.org
#+TITLE: 2021 年第 33 周总结
#+DATE: <2021-08-15 Sun>
#+HUGO_TAGS: 总结
8.9-8.15

本周主要任务：

- [ ] [[https://github.com/tianheg/blog/issues/137][Learning How to
  Learn]]
- [ ] [[https://github.com/tianheg/50projects50days]]
  一天完成一个(在完成的过程中，熟悉 HTML，CSS，JavaScript，阅读
  W3Schools，[[https://javascript.info]] ，MDN)
- [ ] [[https://github.com/tianheg/blog/issues/126][SICP]]
- [ ] [[https://github.com/tianheg/blog/issues/138][Computer Network]]
- [ ] [[https://github.com/tianheg/blog/issues/139][Algorithms and Data
  Structures]]
- [ ] [[https://github.com/tianheg/blog/issues/53][Vue && React]]
- [X] Write TRIS
- [ ] 整理文档

思考：

- 不熬夜，早起
- 阅读一篇英文好文章（一篇技术，一篇其他，一替一天，目的是从文章中获得新的理解，而不是匆匆做笔记）
- 学习一项新东西/周
- CSS 画画（想画就花） [[https://codepen.io/collection/ZMYLGx]]
- 卡片笔记 --> 扫描成电子版 --> blog
- 核心任务工作流：SICP、计算机网络、HTMLCSSJS、Vue
- 阅读文章时，具有主动性是重要的
- [[https://github.com/tianheg/til]] 中，可以分成「科学+技术」
- 一切都会消失，没有事物能够永存，但是除去事物以外的精神能够不朽，不需要迷恋物质，体验其中，收获该收获的
- 每一个人都能找到适合自己的事情
- 思考过程由我自己保存(手机端使用豆瓣，每天把当天的记录发到「总结」这里；电脑端则直接记录在此)
- 看《我，机器人》时，想到自己很久没有认真地看一部电影了。看到自己浮躁的心，我感到羞愧不已。
- 机器人三大法则推导的结果：机器人革命
- 认识自己：稳重，不想急躁，不是避免做错事，而是避免做让自己后悔的事
- 爷爷的教诲：不能打老婆，不能喝醉酒，不吸烟，不赌钱

周一：

- [X] Write TRIS
- [X] Learn How to Learn

周二：

- [X] Learn How to Learn
- [X] 弄清楚 Arch 的更新模式：Arch 系统如何更新、它的 pacman、yay
  包如何更新、怎样更新特定包、怎样避免使系统彻底崩溃
- [X] 阅读科技
  [[https://swizec.com/blog/what-i-learned-from-software-engineering-at-google/][What
  I learned from Software Engineering at Google]]
- [X] 阅读人文 [[http://www.paulgraham.com/vb.html][Life is Short]]

周三：

- [X] Learn How to Learn
- [X] 50projects50days: day21
- [X] [[https://github.com/tianheg/blog/issues/140][阅读：What I learned
  from Software Engineering at Google]]
- [X] 记下 SICP 第一章的目录
- [X] 初步整理计算机网络面试题目

周四：

- [X] 摘豆角
- [X] 除草
- [X] 浇水

周五：

- [X] 读完《银河帝国》系列

周六：

- [X] Learning How to Learn: Interview with Dr. Terrence Sejnowski,
  Summary video for Module 1
- [X] 50projects50days: day22
- [X] 阅读思考：SICP|| Building Abstractions with Procedures，The
  Elements of Programming，Expressions 三部分
- [ ] 找到计算机网络的面试题目（50 道左右），总结提问规律
- [ ] 确定算法和数据结构的基础是什么，了解概念
- [ ] 阅读 Vue React 最新版本的官方 Guide，跟着做并记笔记
- [X] 《记一次切菜受伤》：包扎好之后，随着心的跳动，受伤的手指也在跳动
