blog/2021/2021-33.html
<!DOCTYPE html>
<html lang="zh">
<head>
<!-- 2022-02-09 Wed 10:00 -->
<meta charset="utf-8">
<meta name="viewport" content="width=device-width, initial-scale=1">
<title>2021 年第 33 周总结</title>
<meta name="generator" content="Org mode">
<link rel="stylesheet" href="https://cdn.jsdelivr.net/gh/highlightjs/cdn-release@11.4.0/build/styles/base16/dracula.min.css">
<link rel="stylesheet" href="/theme/site.css"/>
</head>
<body>
<div id="content">
<header>
<h1 class="title">2021 年第 33 周总结</h1>
</header><p>
8.9-8.15
</p>

<p>
本周主要任务：
</p>

<ul class="org-ul">
<li class="off"><code>[&#xa0;]</code> <a href="https://github.com/tianheg/blog/issues/137">Learning How to
Learn</a></li>
<li class="off"><code>[&#xa0;]</code> <a href="https://github.com/tianheg/50projects50days">https://github.com/tianheg/50projects50days</a>
一天完成一个(在完成的过程中，熟悉 HTML，CSS，JavaScript，阅读
W3Schools，<a href="https://javascript.info">https://javascript.info</a> ，MDN)</li>
<li class="off"><code>[&#xa0;]</code> <a href="https://github.com/tianheg/blog/issues/126">SICP</a></li>
<li class="off"><code>[&#xa0;]</code> <a href="https://github.com/tianheg/blog/issues/138">Computer Network</a></li>
<li class="off"><code>[&#xa0;]</code> <a href="https://github.com/tianheg/blog/issues/139">Algorithms and Data
Structures</a></li>
<li class="off"><code>[&#xa0;]</code> <a href="https://github.com/tianheg/blog/issues/53">Vue &amp;&amp; React</a></li>
<li class="on"><code>[X]</code> Write TRIS</li>
<li class="off"><code>[&#xa0;]</code> 整理文档</li>
</ul>

<p>
思考：
</p>

<ul class="org-ul">
<li>不熬夜，早起</li>
<li>阅读一篇英文好文章（一篇技术，一篇其他，一替一天，目的是从文章中获得新的理解，而不是匆匆做笔记）</li>
<li>学习一项新东西/周</li>
<li>CSS 画画（想画就花） <a href="https://codepen.io/collection/ZMYLGx">https://codepen.io/collection/ZMYLGx</a></li>
<li>卡片笔记 &#x2013;&gt; 扫描成电子版 &#x2013;&gt; blog</li>
<li>核心任务工作流：SICP、计算机网络、HTMLCSSJS、Vue</li>
<li>阅读文章时，具有主动性是重要的</li>
<li><a href="https://github.com/tianheg/til">https://github.com/tianheg/til</a> 中，可以分成「科学+技术」</li>
<li>一切都会消失，没有事物能够永存，但是除去事物以外的精神能够不朽，不需要迷恋物质，体验其中，收获该收获的</li>
<li>每一个人都能找到适合自己的事情</li>
<li>思考过程由我自己保存(手机端使用豆瓣，每天把当天的记录发到「总结」这里；电脑端则直接记录在此)</li>
<li>看《我，机器人》时，想到自己很久没有认真地看一部电影了。看到自己浮躁的心，我感到羞愧不已。</li>
<li>机器人三大法则推导的结果：机器人革命</li>
<li>认识自己：稳重，不想急躁，不是避免做错事，而是避免做让自己后悔的事</li>
<li>爷爷的教诲：不能打老婆，不能喝醉酒，不吸烟，不赌钱</li>
</ul>

<p>
周一：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Write TRIS</li>
<li class="on"><code>[X]</code> Learn How to Learn</li>
</ul>

<p>
周二：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Learn How to Learn</li>
<li class="on"><code>[X]</code> 弄清楚 Arch 的更新模式：Arch 系统如何更新、它的 pacman、yay
包如何更新、怎样更新特定包、怎样避免使系统彻底崩溃</li>
<li class="on"><code>[X]</code> 阅读科技
<a href="https://swizec.com/blog/what-i-learned-from-software-engineering-at-google/">What
I learned from Software Engineering at Google</a></li>
<li class="on"><code>[X]</code> 阅读人文 <a href="http://www.paulgraham.com/vb.html">Life is Short</a></li>
</ul>

<p>
周三：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Learn How to Learn</li>
<li class="on"><code>[X]</code> 50projects50days: day21</li>
<li class="on"><code>[X]</code> <a href="https://github.com/tianheg/blog/issues/140">阅读：What I learned
from Software Engineering at Google</a></li>
<li class="on"><code>[X]</code> 记下 SICP 第一章的目录</li>
<li class="on"><code>[X]</code> 初步整理计算机网络面试题目</li>
</ul>

<p>
周四：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 摘豆角</li>
<li class="on"><code>[X]</code> 除草</li>
<li class="on"><code>[X]</code> 浇水</li>
</ul>

<p>
周五：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> 读完《银河帝国》系列</li>
</ul>

<p>
周六：
</p>

<ul class="org-ul">
<li class="on"><code>[X]</code> Learning How to Learn: Interview with Dr. Terrence Sejnowski,
Summary video for Module 1</li>
<li class="on"><code>[X]</code> 50projects50days: day22</li>
<li class="on"><code>[X]</code> 阅读思考：SICP|| Building Abstractions with Procedures，The
Elements of Programming，Expressions 三部分</li>
<li class="off"><code>[&#xa0;]</code> 找到计算机网络的面试题目（50 道左右），总结提问规律</li>
<li class="off"><code>[&#xa0;]</code> 确定算法和数据结构的基础是什么，了解概念</li>
<li class="off"><code>[&#xa0;]</code> 阅读 Vue React 最新版本的官方 Guide，跟着做并记笔记</li>
<li class="on"><code>[X]</code> 《记一次切菜受伤》：包扎好之后，随着心的跳动，受伤的手指也在跳动</li>
</ul>
</div>
</body>
</html>